<?php
/**
 * Created by PhpStorm.
 * User: lihaijiang
 * Date: 2018/10/17
 * Time: 10:41 AM
 */
//页面中的筛选条件
$screen = [5 => '撤销', 6 => '已上传', 10 => '已提交', 20 => '审核不通过', 25 => '驳回', 30 => '审核通过',46=>'申请缓缴费',47=>'缓缴费失败', 48 => '缴费中', 49 => '缓缴费成功', 50 => '已缴费', 55 => '已打印准考证'];
$GradeResult = [-3 => '缺考', -2 => '违纪', -1 =>'违规', 1 =>'通过', 2=>'不通过'];




$arr1 = [1 => '正常', -1 => '删除', 5 => '已上传', 10 => '已提交', 15 => '已打印报名表', 20 => '审核通过', 30 => '驳回', 40 => '审核不通过',46=>'申请缓缴费',45=>'撤销', 48 => '缴费中', 50 => '已缴费', 51 => '缓缴费成功',52=>'缓缴费申请失败', 55 => '已打印准考证'];

$arr = [1 => '正常', -1 => '删除', 5 => '撤销',6 => '已上传', 10 => '已提交', 15 => '已打印报名表', 20 => '审核未通过','25'=>'驳回', 30 => '审核通过',46=>'申请缓缴费',47=>'缓缴费失败', 48 => '缴费中', 49 =>'缴费成功', 50 => '已缴费', 55 => '已打印准考证',60=>'查询成绩', 65 => '申领证书'];

$arrsource = [1 => '鉴定所', 2 => '院校', 3 => '机构', 4 => '企业', 5 => '学校', 6 => '机关事业单位', 7 => '社会', -1 => '其他'];

$arrExamResult=[-3 => '缺考', -2 => '违纪', -1 =>'违规', 0 => '默认', 1 =>'通过', 2=>'不通过'];
$certType = [0 => '未选择', 1 =>'自取', 2 =>'邮寄'];
$thesis_state = [0 => '未上传',1 => '未上传',2 => '已上传'];
$work_level_subject_level = [''=>"无",0 => '无',1 => '高级技师', 2 => '技师', 3 => '高级', 4 => '中级', 5 => '初级', '00' => '考评员', '01' => '高级考评员'];
$id_type = [1 => '身份证',2 => '护照',3 => '军官证',4 => '港澳台证',5 =>'其他'];
$education = [1 => '博士',2 => '硕士',3 => '研究生',4 => '专科',5 =>'本科',6 =>'高职',7 =>'中专',8 =>'技校',9 =>'高中',10 =>'初中',11 =>'小学',null => '未知' ];
$audit_way = [0 => '线下审核',1 => '线上审核'];

$grade = [-3=>'缺考',-2=>'违纪',-1=>'违规',0=>'正常',1=>'合格',2=>'不合格'];
$exam_type = [1=>'新考',2=>'补考'];

$allot = [0=>'已提交',1=>'申请失败',2=>'申请成功',3=>'中心修改'];
$slowpay = [1=>'初审通过',2=>'初审未通过',3=>'复审通过',4=>'复审未通过',20=>'终审通过',51=>'终审未通过',52=>'终审未通过'];




return ['status' => $arr, 'source' => $arrsource, 'result'=>$arrExamResult, 'cert_way'=>$certType,'thesis_state'=>$thesis_state,'work_level_subject_level'=>$work_level_subject_level,'id_type'=>$id_type,'education'=>$education,'audit_way'=>$audit_way,'grade'=>$grade,'exam_type'=>$exam_type,'screen'=>$screen,'graderesult'=>$GradeResult,'allot'=>$allot,'slowpay'=>$slowpay];
